---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.OutsideAirPerArea
source: html/e64e7fb7-db8b-f237-b5c1-ed612d9b72ec.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.OutsideAirPerArea Property

The rate of flow of outside air available per unit area.

## Syntax (C#)
```csharp
public double OutsideAirPerArea { get; set; }
```

## Remarks
Stored in cubic feet per hour per square foot.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The outside airPerArea does not fall within an appropriate range.